package by.it.busel.lesson04;

/*
Вывести таблицу умножения 10 x 10 (двоныйм циклом),
но вывод должен быть словами:

Ожидаемый вывод:
два умножить на два равно четыре
два умножить на три равно шесть
два умножить на четыре равно восемь
два умножить на пять равно десять
два умножить на шесть равно двенадцать
два умножить на семь равно четырнадцать
два умножить на восемь равно шестнадцать
два умножить на девять равно восемнадцать
два умножить на десять равно двадцать
три умножить на два равно шесть
три умножить на три равно девять
три умножить на четыре равно двенадцать
...
и т.д. до фразы
...
десять умножить на десять равно сто
*/

public class TaskC3 {
    public static void main(String[] args) {
        int y, x;
        String[] words = {"ноль", "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять", "десять"};
        String[] wordsY2 = {"ноль", "два", "четыре", "шесть", "восемь", "десять", "двенадцать", "четырнадцать", "шестнадцать", "восемнадцать", "двадцать"};
        String[] wordsY3 = {"ноль", "три", "шесть", "девять", "двенадцать", "пятнадцать", "восемнадцать", "двадцать один", "двадцать четыре", "двадцать семь", "тридцать"};
        String[] wordsY4 = {"ноль", "четыре", "восемь", "двенадцать", "шестнадцать", "двадцать", "двадцать четыре", "двадцать восемь", "тридцать два", "тридцать шесть", "сорок"};
        String[] wordsY5 = {"ноль", "пять", "десять", "пятнадцать", "двадцать", "двадцать пять", "тридцать", "тридцать пять", "сорок", "сорок пять", "пятьдесят"};
        String[] wordsY6 = {"ноль", "шесть", "двенадцать", "восемнадцать", "двадцать четыре", "тридцать", "тридцать шесть", "сорок два", "сорок восемь", "пятьдесят четыре", "шестьдесят"};
        String[] wordsY7 = {"ноль", "семь", "четырнадцать", "двадцать один", "двадцать восемь", "тридцать пять", "сорок два", "сорок девять", "пятьдесят шесть", "шестьдесят три", "семьдесят"};
        String[] wordsY8 = {"ноль", "восемь", "шестнадцать", "двадцать четыре", "тридцать два", "сорок", "сорок восемь", "пятьдесят шесть", "шестьдесят четыре", "семьдесят два", "восемьдесят"};
        String[] wordsY9 = {"ноль", "девять", "восемнадцать", "двадцать семь", "тридцать шесть", "сорок пять", "пятьдесят четыре", "шестьдесят три", "семьдесят два", "восемьдесят один", "девяносто"};
        String[] wordsY10 = {"ноль", "десять", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто", "сто"};

        for (y = 2; y <= 10; y++) {

            for (x = 2; x <= 10; x++) {
                switch (y) {
                    case 2:
                        System.out.println(words[y] + " умножить на " + words[x] + " равно " + wordsY2[x]);
                        break;
                    case 3:
                        System.out.println(words[y] + " умножить на " + words[x] + " равно " + wordsY3[x]);
                        break;
                    case 4:
                        System.out.println(words[y] + " умножить на " + words[x] + " равно " + wordsY4[x]);
                        break;
                    case 5:
                        System.out.println(words[y] + " умножить на " + words[x] + " равно " + wordsY5[x]);
                        break;
                    case 6:
                        System.out.println(words[y] + " умножить на " + words[x] + " равно " + wordsY6[x]);
                        break;
                    case 7:
                        System.out.println(words[y] + " умножить на " + words[x] + " равно " + wordsY7[x]);
                        break;
                    case 8:
                        System.out.println(words[y] + " умножить на " + words[x] + " равно " + wordsY8[x]);
                        break;
                    case 9:
                        System.out.println(words[y] + " умножить на " + words[x] + " равно " + wordsY9[x]);
                        break;
                    case 10:
                        System.out.println(words[y] + " умножить на " + words[x] + " равно " + wordsY10[x]);
                        break;
                }
            }
        }
    }

}
